ICARUS/computation/solvers/OpenFoam/files/0/U
/*----------------------------------------------------------------------------------*\
|                                                                                    |
|    ANSA_VERSION: 22.1.0                                                            |
|                                                                                    |
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              |
|                                                                                    |
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             |
|                                                                                    |
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class volVectorField;
	location "";
	object U;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions [0 1 -1 0 0 0 0];

internalField uniform ( 1.0 0.0 0. );


boundaryField
{
	Farfield
	{
		type freestream;
		freestreamValue	$internalField;
	}

	Airfoil
	{
		type	noSlip;
	}

	SideHigh
	{
		type empty;
	}
	SideLow
	{
		type empty;
	}


}
