ICARUS/computation/solvers/OpenFoam/files/0/omega
/*----------------------------------------------------------------------------------*\
|                                                                                    |
|    ANSA_VERSION: 22.1.0                                                            |
|                                                                                    |
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              |
|                                                                                    |
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             |
|                                                                                    |
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class volScalarField;
	location "";
	object omega;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/


dimensions [0 0 -1 0 0 0 0];

internalField uniform 122.5;


boundaryField
{
	Farfield
	{
		type inletOutlet;
		value uniform 122.5;
		inletValue uniform 122.5;
	}

	Airfoil
	{
		type omegaWallFunction;
		value uniform 122.5;
	}

	SideHigh
	{
		type empty;
	}

	SideLow
	{
		type empty;
	}

}
