ICARUS/computation/solvers/OpenFoam/files/system/decomposeParDict
/*----------------------------------------------------------------------------------*\
|                                                                                    |
|    ANSA_VERSION: 22.1.0                                                            |
|                                                                                    |
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              |
|                                                                                    |
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             |
|                                                                                    |
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class dictionary;
	location "";
	object decomposeParDict;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

numberOfSubdomains 4;
method scotch;
